/**
 * # 国际化语言包枚举
 * @anchor Hamm
 */
export enum AirLanguage {
  /**
   * ### 英语
   * 国际上最广泛使用的语言之一，也是互联网上的主导语言。
   */
  English = 'English',

  /**
   * ### 简体中文
   * 汉语的一种形式，主要在中国大陆、新加坡等地使用，用户基数庞大。
   */
  ChineseSimplified = '简体中文',

  /**
   * ### 繁体中文
   * 又称正体字或传统汉字，主要在台湾、香港、澳门等地区使用。
   */
  ChineseTraditional = '繁體中文',

  /**
   * ### 西班牙语
   * 在美洲、西班牙以及全球范围内有大量使用者，是联合国工作语言之一。
   */
  Spanish = 'Español',

  /**
   * ### 阿拉伯语
   * 主要分布在中东和北非地区，从右至左书写，为伊斯兰教的官方语言。
   */
  Arabic = 'عربي',

  /**
   * ### 德语
   * 欧洲最重要的语言之一，在德国、奥地利、瑞士等国家广泛使用。
   */
  German = 'Deutsch',

  /**
   * ### 法语
   * 作为联合国和欧盟的工作语言之一，法语在全球范围内的影响力较大。
   */
  French = 'Französisch',

  /**
   * ### 俄语
   * 在俄罗斯及周边国家中占主导地位，同时也是东欧和中亚地区的重要语言。
   */
  Russian = 'Русский',

  /**
   * ### 日语
   * 日本的官方语言，全球范围内有大量的学习者和使用者。
   */
  Japanese = '日本語',

  /**
   * ### 印地语
   * 印度最常用的语言，也是世界上最多人使用的母语之一。
   */
  Hindi = 'नहीं।',

  /**
   * ### 印尼语
   * 印度尼西亚的官方语言，东南亚地区广泛使用。
   */
  Indonesian = 'bahasa Indo',

  /**
   * ### 土耳其语
   * 土耳其的官方语言，同时也在土耳其裔人口分布的其他国家使用。
   */
  Turkish = 'Türkçe',

  /**
   * ### 韩语
   * 韩国的官方语言，同时也被称为朝鲜语，在朝鲜和世界各地韩裔社区中使用。
   */
  Korean = '한국인',

  /**
   * ### 泰语
   * 泰国的官方语言，东南亚地区的重要语言之一。
   */
  Thai = 'แบบไทย',

  /**
   * ### 意大利语
   * 意大利的官方语言，欧洲南部地区广泛使用，并且是文化与艺术领域中的重要语言。
   */
  Italian = 'Italiano',
}
